In [1]:
%load_ext sql

In [2]:
%sql mysql+pymysql://root:HardThings25@localhost:3306/md_water_services

In [3]:
%%sql
SHOW 
Tables

 * mysql+pymysql://root:***@localhost:3306/md_water_services
10 rows affected.

[('data_dictionary',),
 ('employee',),
 ('global_water_access',),
 ('location',),
 ('quality_score',),
 ('sample_rec',),
 ('visits',),
 ('water_quality',),
 ('water_source',),
 ('well_pollution',)]

In [4]:
%%sql
SELECT
    Employee_name,
    CONCAT(
   LOWER(REPLACE(employee_name,' ', '.')), '@ndogowater.gov') AS new_email
FROM
Employee
limit 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('Amara Jengo', 'amara.jengo@ndogowater.gov'),
 ('Bello Azibo', 'bello.azibo@ndogowater.gov'),
 ('Bakari Iniko', 'bakari.iniko@ndogowater.gov'),
 ('Malachi Mavuso', 'malachi.mavuso@ndogowater.gov'),
 ('Cheche Buhle', 'cheche.buhle@ndogowater.gov')]

In [5]:
%%sql
UPDATE employee
SET email = CONCAT(
    
   LOWER(REPLACE(employee_name,' ', '.')), '@ndogowater.gov')
limit 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[]

In [6]:
%%sql
SELECT 
*
FROM
Employee
limit 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[(0, 'Amara Jengo', '+99637993287', 'amara.jengo@ndogowater.gov', '36 Pwani Mchangani Road', 'Sokoto', 'Ilanga', 'Field Surveyor'),
 (1, 'Bello Azibo', '+99643864786', 'bello.azibo@ndogowater.gov', '129 Ziwa La Kioo Road', 'Kilimani', 'Rural', 'Field Surveyor'),
 (2, 'Bakari Iniko', '+99222599041', 'bakari.iniko@ndogowater.gov', '18 Mlima Tazama Avenue', 'Hawassa', 'Rural', 'Field Surveyor'),
 (3, 'Malachi Mavuso', '+99945849900', 'malachi.mavuso@ndogowater.gov', '100 Mogadishu Road', 'Akatsi', 'Lusaka', 'Field Surveyor'),
 (4, 'Cheche Buhle', '+99381679640', 'cheche.buhle@ndogowater.gov', '1 Savanna Street', 'Akatsi', 'Rural', 'Field Surveyor')]

In [7]:
%%sql
SHOW COLUMNS FROM Employee

 * mysql+pymysql://root:***@localhost:3306/md_water_services
8 rows affected.

[('assigned_employee_id', 'int', 'NO', 'PRI', None, ''),
 ('employee_name', 'varchar(255)', 'YES', '', None, ''),
 ('phone_number', 'varchar(15)', 'YES', '', None, ''),
 ('email', 'varchar(255)', 'YES', '', None, ''),
 ('address', 'varchar(255)', 'YES', '', None, ''),
 ('province_name', 'varchar(255)', 'YES', '', None, ''),
 ('town_name', 'varchar(255)', 'YES', '', None, ''),
 ('position', 'varchar(255)', 'YES', '', None, '')]

In [8]:
%%sql
SELECT
    Phone_Number,
    (LENGTH(Phone_number)) AS length
FROM employee
Limit 5;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('+99637993287', 12),
 ('+99643864786', 12),
 ('+99222599041', 12),
 ('+99945849900', 12),
 ('+99381679640', 12)]

In [9]:
%%sql
UPDATE Employee
SET
Phone_number = TRIM(Phone_number)

 * mysql+pymysql://root:***@localhost:3306/md_water_services
56 rows affected.

[]

In [19]:
%%sql
SELECT
    Town_name,
    province_name,
    COUNT(Employee_name) AS No_of_employees
FROM
Employee
GROUP BY Town_name,province_name

 * mysql+pymysql://root:***@localhost:3306/md_water_services
15 rows affected.

[('Ilanga', 'Sokoto', 2),
 ('Rural', 'Kilimani', 9),
 ('Rural', 'Hawassa', 7),
 ('Lusaka', 'Akatsi', 4),
 ('Rural', 'Akatsi', 5),
 ('Zanzibar', 'Hawassa', 4),
 ('Dahabu', 'Amanzi', 6),
 ('Rural', 'Sokoto', 7),
 ('Kintampo', 'Akatsi', 1),
 ('Harare', 'Akatsi', 3),
 ('Ilanga', 'Kilimani', 1),
 ('Yaounde', 'Hawassa', 1),
 ('Serowe', 'Hawassa', 3),
 ('Harare', 'Kilimani', 2),
 ('Rural', 'Amanzi', 1)]

In [16]:
%%sql
SELECT
 assigned_employee_id,
 COUNT(visit_count)  AS no_of_visits 
FROM visits
GROUP BY assigned_employee_id
ORDER BY no_of_visits DESC;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
29 rows affected.

[(1, 3708),
 (30, 3676),
 (34, 3539),
 (3, 3420),
 (10, 3407),
 (8, 3351),
 (5, 3284),
 (36, 3249),
 (48, 2933),
 (28, 2762),
 (12, 2561),
 (42, 2496),
 (40, 2344),
 (38, 2121),
 (2, 2033),
 (24, 2015),
 (32, 1852),
 (18, 1749),
 (46, 1632),
 (14, 1441),
 (7, 1259),
 (6, 1182),
 (4, 1136),
 (0, 1099),
 (16, 802),
 (26, 719),
 (44, 218),
 (22, 143),
 (20, 15)]

In [17]:
%%sql
SELECT
assigned_employee_id,
employee_name,
email,
Phone_number
FROM
employee
WHERE assigned_employee_id IN(22,20)

 * mysql+pymysql://root:***@localhost:3306/md_water_services
2 rows affected.

[(20, 'Kunto Asha', 'kunto.asha@ndogowater.gov', '+99176320477'),
 (22, 'Lesedi Kofi', 'lesedi.kofi@ndogowater.gov', '+99611183730')]

In [13]:
%%sql
SELECT

COUNT(Location_id) AS Records_per_town ,
Town_name
FROM
Location 


GROUP BY Town_name

 * mysql+pymysql://root:***@localhost:3306/md_water_services
25 rows affected.

[(1650, 'Harare'),
 (780, 'Kintampo'),
 (1070, 'Lusaka'),
 (23740, 'Rural'),
 (400, 'Abidjan'),
 (1090, 'Amina'),
 (930, 'Asmara'),
 (400, 'Bello'),
 (930, 'Dahabu'),
 (520, 'Pwani'),
 (350, 'Deka'),
 (310, 'Djenne'),
 (480, 'Serowe'),
 (270, 'Yaounde'),
 (300, 'Zanzibar'),
 (710, 'Amara'),
 (770, 'Isiqalo'),
 (990, 'Mrembo'),
 (750, 'Zuri'),
 (470, 'Bahari'),
 (370, 'Cheche'),
 (780, 'Ilanga'),
 (510, 'Kofi'),
 (620, 'Majengo'),
 (460, 'Marang')]

In [14]:
%%sql
SELECT

COUNT(Location_id) AS Records_per_province ,
province_name
FROM
Location 


GROUP BY Province_name

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[(8940, 'Akatsi'),
 (6950, 'Amanzi'),
 (6030, 'Hawassa'),
 (9510, 'Kilimani'),
 (8220, 'Sokoto')]

In [15]:
%%sql
SELECT
province_name,
Town_name,
COUNT(Location_id) AS Records_per_province 
FROM
Location 
GROUP BY town_name,Province_name;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
31 rows affected.

[('Akatsi', 'Harare', 800),
 ('Akatsi', 'Kintampo', 780),
 ('Akatsi', 'Lusaka', 1070),
 ('Akatsi', 'Rural', 6290),
 ('Amanzi', 'Abidjan', 400),
 ('Amanzi', 'Amina', 670),
 ('Amanzi', 'Asmara', 930),
 ('Amanzi', 'Bello', 400),
 ('Amanzi', 'Dahabu', 930),
 ('Amanzi', 'Pwani', 520),
 ('Amanzi', 'Rural', 3100),
 ('Hawassa', 'Amina', 420),
 ('Hawassa', 'Deka', 350),
 ('Hawassa', 'Djenne', 310),
 ('Hawassa', 'Rural', 3900),
 ('Hawassa', 'Serowe', 480),
 ('Hawassa', 'Yaounde', 270),
 ('Hawassa', 'Zanzibar', 300),
 ('Kilimani', 'Amara', 710),
 ('Kilimani', 'Harare', 850),
 ('Kilimani', 'Isiqalo', 770),
 ('Kilimani', 'Mrembo', 990),
 ('Kilimani', 'Rural', 5440),
 ('Kilimani', 'Zuri', 750),
 ('Sokoto', 'Bahari', 470),
 ('Sokoto', 'Cheche', 370),
 ('Sokoto', 'Ilanga', 780),
 ('Sokoto', 'Kofi', 510),
 ('Sokoto', 'Majengo', 620),
 ('Sokoto', 'Marang', 460),
 ('Sokoto', 'Rural', 5010)]

In [16]:
%%sql
SELECT
COUNT(Location_id) AS num_sources,
Location_type
FROM
Location
GROUP BY location_type

 * mysql+pymysql://root:***@localhost:3306/md_water_services
2 rows affected.

[(15910, 'Urban'), (23740, 'Rural')]

In [17]:
%%sql
SELECT ROUND(23740/(15910 + 23740) * 100) AS pct_rural

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(Decimal('60'),)]

In [18]:
%%sql
SHOW COLUMNS FROM water_source

 * mysql+pymysql://root:***@localhost:3306/md_water_services
3 rows affected.

[('source_id', 'varchar(510)', 'NO', 'PRI', None, ''),
 ('type_of_water_source', 'varchar(255)', 'YES', '', None, ''),
 ('number_of_people_served', 'int', 'YES', '', None, '')]

In [19]:
%%sql
SELECT
*
FROM
water_source
limit 10;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
10 rows affected.

[('AkHa00000224', 'tap_in_home', 956),
 ('AkHa00001224', 'tap_in_home_broken', 930),
 ('AkHa00002224', 'tap_in_home_broken', 486),
 ('AkHa00003224', 'well', 364),
 ('AkHa00004224', 'tap_in_home_broken', 942),
 ('AkHa00005224', 'tap_in_home', 736),
 ('AkHa00006224', 'tap_in_home', 882),
 ('AkHa00007224', 'tap_in_home', 554),
 ('AkHa00008224', 'well', 398),
 ('AkHa00009224', 'well', 346)]

In [20]:
%%sql
SELECT
SUM(number_of_people_served)
FROM water_source

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(Decimal('27628140'),)]

In [21]:

%%sql
SELECT
type_of_water_source,
COUNT(source_id) AS total_no

FROM water_source
GROUP BY type_of_water_source

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('tap_in_home', 7265),
 ('tap_in_home_broken', 5856),
 ('well', 17383),
 ('shared_tap', 5767),
 ('river', 3379)]

In [22]:
%%sql
SELECT
Type_of_water_source,
ROUND(AVG(number_of_people_served)) AS AVG_people_per_source
FROM water_source
GROUP By Type_of_water_source

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('tap_in_home', Decimal('644')),
 ('tap_in_home_broken', Decimal('649')),
 ('well', Decimal('279')),
 ('shared_tap', Decimal('2071')),
 ('river', Decimal('699'))]

In [23]:

%%sql
SELECT
Type_of_water_source,
SUM(number_of_people_served) AS Sum_people_per_source
FROM water_source
GROUP By Type_of_water_source 
ORDER BY Sum_people_per_source DESC;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('shared_tap', Decimal('11945272')),
 ('well', Decimal('4841724')),
 ('tap_in_home', Decimal('4678880')),
 ('tap_in_home_broken', Decimal('3799720')),
 ('river', Decimal('2362544'))]

In [24]:
%%sql
SELECT
    Type_of_water_source,
  ROUND( SUM(number_of_people_served) * 100.0 
        / SUM(SUM(number_of_people_served)) OVER (),0) AS percentage_served
FROM water_source
GROUP BY Type_of_water_source
ORDER BY percentage_served DESC;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('shared_tap', Decimal('43')),
 ('well', Decimal('18')),
 ('tap_in_home', Decimal('17')),
 ('tap_in_home_broken', Decimal('14')),
 ('river', Decimal('9'))]

In [25]:
%%sql
SELECT
Type_of_water_source,
SUM(number_of_people_served) AS Sum_people_per_source,
RANK() OVER (
    ORDER BY SUM(number_of_people_served) DESC
) AS rank_of_source
FROM water_source
GROUP By Type_of_water_source 
ORDER BY Sum_people_per_source DESC;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
5 rows affected.

[('shared_tap', Decimal('11945272'), 1),
 ('well', Decimal('4841724'), 2),
 ('tap_in_home', Decimal('4678880'), 3),
 ('tap_in_home_broken', Decimal('3799720'), 4),
 ('river', Decimal('2362544'), 5)]

In [39]:
%%sql
SELECT
    source_id,
    type_of_water_source,
    number_of_people_served,
    DENSE_RANK() OVER(
        ORDER BY (number_of_people_served) DESC
    )
AS priority_rank
FROM
    Water_Source

limit 100;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
100 rows affected.

[('HaRu19509224', 'shared_tap', 3998, 1),
 ('AkRu05603224', 'shared_tap', 3998, 1),
 ('AkRu04862224', 'shared_tap', 3996, 2),
 ('KiHa22867224', 'shared_tap', 3996, 2),
 ('AmAs10911224', 'shared_tap', 3996, 2),
 ('HaRu19839224', 'shared_tap', 3994, 3),
 ('KiZu31330224', 'shared_tap', 3994, 3),
 ('KiZu31415224', 'shared_tap', 3992, 4),
 ('KiRu28630224', 'shared_tap', 3992, 4),
 ('KiRu26218224', 'shared_tap', 3990, 5),
 ('AmPw12653224', 'shared_tap', 3990, 5),
 ('SoRu38511224', 'shared_tap', 3990, 5),
 ('SoRu36687224', 'shared_tap', 3988, 6),
 ('SoRu35346224', 'shared_tap', 3988, 6),
 ('SoRu36081224', 'shared_tap', 3988, 6),
 ('HaRu18763224', 'shared_tap', 3988, 6),
 ('KiRu29517224', 'shared_tap', 3986, 7),
 ('AmAm09725224', 'shared_tap', 3986, 7),
 ('AkRu05842224', 'shared_tap', 3984, 8),
 ('AmBe11275224', 'shared_tap', 3984, 8),
 ('HaRu18154224', 'shared_tap', 3984, 8),
 ('SoRu35398224', 'shared_tap', 3984, 8),
 ('SoRu38869224', 'shared_tap', 3984, 8),
 ('SoRu37216224', 'shared_tap', 3982, 9),
 ('KiRu28844224', 'shared_tap', 3982, 9),
 ('AkRu06647224', 'shared_tap', 3982, 9),
 ('SoRu35229224', 'shared_tap', 3982, 9),
 ('HaRu20823224', 'shared_tap', 3982, 9),
 ('KiMr24719224', 'shared_tap', 3982, 9),
 ('KiRu25344224', 'shared_tap', 3980, 10),
 ('AmRu13722224', 'shared_tap', 3980, 10),
 ('SoRu38339224', 'shared_tap', 3980, 10),
 ('SoRu35598224', 'shared_tap', 3980, 10),
 ('AkRu06374224', 'shared_tap', 3980, 10),
 ('AkRu07796224', 'shared_tap', 3978, 11),
 ('AmAb09339224', 'shared_tap', 3978, 11),
 ('KiRu25702224', 'shared_tap', 3978, 11),
 ('KiZu31086224', 'shared_tap', 3978, 11),
 ('HaRu18222224', 'shared_tap', 3978, 11),
 ('SoRu37693224', 'shared_tap', 3978, 11),
 ('SoRu39073224', 'shared_tap', 3976, 12),
 ('SoRu35204224', 'shared_tap', 3976, 12),
 ('AkRu03444224', 'shared_tap', 3974, 13),
 ('SoRu36782224', 'shared_tap', 3974, 13),
 ('AkRu04657224', 'shared_tap', 3972, 14),
 ('AkRu03117224', 'shared_tap', 3970, 15),
 ('AkRu04357224', 'shared_tap', 3970, 15),
 ('KiRu28759224', 'shared_tap', 3970, 15),
 ('KiRu29158224', 'shared_tap', 3970, 15),
 ('AmRu15466224', 'shared_tap', 3970, 15),
 ('HaRu18399224', 'shared_tap', 3970, 15),
 ('KiZu31296224', 'shared_tap', 3968, 16),
 ('KiRu25414224', 'shared_tap', 3968, 16),
 ('AkRu05208224', 'shared_tap', 3962, 17),
 ('SoRu35132224', 'shared_tap', 3960, 18),
 ('AkRu06749224', 'shared_tap', 3958, 19),
 ('AkRu08091224', 'shared_tap', 3958, 19),
 ('HaRu19088224', 'shared_tap', 3958, 19),
 ('AkRu07466224', 'shared_tap', 3956, 20),
 ('AkRu03258224', 'shared_tap', 3956, 20),
 ('KiRu30056224', 'shared_tap', 3956, 20),
 ('KiRu27212224', 'shared_tap', 3954, 21),
 ('KiRu30571224', 'shared_tap', 3954, 21),
 ('AmAs10579224', 'shared_tap', 3952, 22),
 ('AmRu13488224', 'shared_tap', 3952, 22),
 ('AmRu15209224', 'shared_tap', 3952, 22),
 ('SoRu34996224', 'shared_tap', 3952, 22),
 ('SoRu35794224', 'shared_tap', 3952, 22),
 ('AkRu03733224', 'shared_tap', 3952, 22),
 ('AmAs10546224', 'shared_tap', 3950, 23),
 ('AmAs10638224', 'shared_tap', 3950, 23),
 ('KiRu29396224', 'shared_tap', 3948, 24),
 ('SoRu34652224', 'shared_tap', 3948, 24),
 ('AkRu07459224', 'shared_tap', 3946, 25),
 ('KiRu27464224', 'shared_tap', 3946, 25),
 ('KiRu26652224', 'shared_tap', 3944, 26),
 ('KiRu29941224', 'shared_tap', 3944, 26),
 ('KiRu30486224', 'shared_tap', 3944, 26),
 ('AmBe11046224', 'shared_tap', 3944, 26),
 ('AkRu04980224', 'shared_tap', 3944, 26),
 ('KiRu30138224', 'shared_tap', 3938, 27),
 ('KiRu30216224', 'shared_tap', 3936, 28),
 ('AkRu04734224', 'shared_tap', 3936, 28),
 ('SoRu38929224', 'shared_tap', 3936, 28),
 ('HaRu19750224', 'shared_tap', 3934, 29),
 ('AkRu06187224', 'shared_tap', 3934, 29),
 ('SoRu37856224', 'shared_tap', 3930, 30),
 ('KiZu31408224', 'shared_tap', 3930, 30),
 ('SoRu35557224', 'shared_tap', 3930, 30),
 ('SoRu35648224', 'shared_tap', 3930, 30),
 ('SoMa34572224', 'shared_tap', 3928, 31),
 ('KiZu30804224', 'shared_tap', 3928, 31),
 ('AmPw12724224', 'shared_tap', 3928, 31),
 ('HaRu19726224', 'shared_tap', 3928, 31),
 ('AkRu05044224', 'shared_tap', 3924, 32),
 ('KiRu25365224', 'shared_tap', 3924, 32),
 ('AkRu04841224', 'shared_tap', 3922, 33),
 ('AmAs10429224', 'shared_tap', 3922, 33),
 ('KiRu26909224', 'shared_tap', 3920, 34),
 ('SoRu37635224', 'shared_tap', 3920, 34)]

In [63]:
%%sql
SELECT 
    MAX(time_of_record) AS Last_day_of_record,
    MIN(time_of_record) AS first_day_of_record,
    TIMESTAMPDIFF(DAY,MIN(time_of_record),MAX(time_of_record)) AS total_days_of_survey
FROM visits

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(datetime.datetime(2023, 7, 14, 13, 53), datetime.datetime(2021, 1, 1, 9, 10), 924)]

In [69]:
%%sql
SELECT
    ROUND(AVG(NULLIF(time_in_queue,0))) AS total_avg
FROM visits
Limit 10;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
1 rows affected.

[(Decimal('123'),)]

In [78]:
%%sql
SELECT
    DAYNAME(time_of_record) AS day_of_week,
   ROUND( AVG(time_in_queue)) AS avg_queue_time
FROM visits
GROUP BY DAYNAME(time_of_record);

 * mysql+pymysql://root:***@localhost:3306/md_water_services
7 rows affected.

[('Friday', Decimal('53')),
 ('Saturday', Decimal('246')),
 ('Sunday', Decimal('82')),
 ('Monday', Decimal('60')),
 ('Tuesday', Decimal('47')),
 ('Wednesday', Decimal('43')),
 ('Thursday', Decimal('46'))]

In [82]:
%%sql
SELECT
    TIME_FORMAT(TIME(time_of_record), '%H:00') AS hour_of_day,
   ROUND( AVG(time_in_queue)) AS avg_queue_time
FROM visits
GROUP BY TIME_FORMAT(TIME(time_of_record), '%H:00')
ORDER BY hour_of_day;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
14 rows affected.

[('06:00', Decimal('149')),
 ('07:00', Decimal('149')),
 ('08:00', Decimal('149')),
 ('09:00', Decimal('49')),
 ('10:00', Decimal('48')),
 ('11:00', Decimal('46')),
 ('12:00', Decimal('47')),
 ('13:00', Decimal('47')),
 ('14:00', Decimal('47')),
 ('15:00', Decimal('48')),
 ('16:00', Decimal('47')),
 ('17:00', Decimal('149')),
 ('18:00', Decimal('147')),
 ('19:00', Decimal('168'))]

In [94]:
%%sql
SELECT
    TIME_FORMAT(TIME(time_of_record), '%H:00') AS hour_of_day,
    ROUND(AVG(CASE WHEN DAYNAME(time_of_record) = 'Sunday' THEN time_in_queue ELSE NULL END),0) AS avg_sunday_queue,
    ROUND(AVG(
    CASE
    WHEN DAYNAME(time_of_record) = 'Monday' THEN time_in_queue
    ELSE NULL
    END),0) AS Monday,
    ROUND(AVG(
    CASE 
    WHEN DAYNAME(time_of_record) = 'Tuesday' THEN time_in_queue
    ELSE NULL
    END),0) AS Tuesday,
    ROUND(AVG(
    CASE 
    WHEN DAYNAME(time_of_record) = 'Wednesday' THEN time_in_queue
    ELSE NULL
    END),0) AS Wednesday,
    ROUND(AVG(
    CASE 
    WHEN DAYNAME(time_of_record) = 'Thursday' THEN time_in_queue
    ELSE NULL
    END),0) AS Thursday,
    ROUND(AVG(
    CASE 
    WHEN DAYNAME(time_of_record) = 'Friday' THEN time_in_queue
    ELSE NULL
    END),0) AS Friday,
    ROUND(AVG(
    CASE 
    WHEN DAYNAME(time_of_record) = 'Saturday' THEN time_in_queue
    ELSE NULL
    END),0) AS Saturday
FROM visits
WHERE time_in_queue != 0
GROUP BY hour_of_day
ORDER BY hour_of_day;

 * mysql+pymysql://root:***@localhost:3306/md_water_services
14 rows affected.

[('06:00', Decimal('79'), Decimal('190'), Decimal('134'), Decimal('112'), Decimal('134'), Decimal('153'), Decimal('247')),
 ('07:00', Decimal('82'), Decimal('186'), Decimal('128'), Decimal('111'), Decimal('139'), Decimal('156'), Decimal('247')),
 ('08:00', Decimal('86'), Decimal('183'), Decimal('130'), Decimal('119'), Decimal('129'), Decimal('153'), Decimal('247')),
 ('09:00', Decimal('84'), Decimal('127'), Decimal('105'), Decimal('94'), Decimal('99'), Decimal('107'), Decimal('252')),
 ('10:00', Decimal('83'), Decimal('119'), Decimal('99'), Decimal('89'), Decimal('95'), Decimal('112'), Decimal('259')),
 ('11:00', Decimal('78'), Decimal('115'), Decimal('102'), Decimal('86'), Decimal('99'), Decimal('104'), Decimal('236')),
 ('12:00', Decimal('78'), Decimal('115'), Decimal('97'), Decimal('88'), Decimal('96'), Decimal('109'), Decimal('239')),
 ('13:00', Decimal('81'), Decimal('122'), Decimal('97'), Decimal('98'), Decimal('101'), Decimal('115'), Decimal('242')),
 ('14:00', Decimal('83'), Decimal('127'), Decimal('104'), Decimal('92'), Decimal('96'), Decimal('110'), Decimal('244')),
 ('15:00', Decimal('83'), Decimal('126'), Decimal('104'), Decimal('88'), Decimal('92'), Decimal('110'), Decimal('248')),
 ('16:00', Decimal('83'), Decimal('127'), Decimal('99'), Decimal('90'), Decimal('99'), Decimal('109'), Decimal('251')),
 ('17:00', Decimal('79'), Decimal('181'), Decimal('135'), Decimal('121'), Decimal('129'), Decimal('151'), Decimal('251')),
 ('18:00', Decimal('80'), Decimal('174'), Decimal('122'), Decimal('113'), Decimal('132'), Decimal('158'), Decimal('240')),
 ('19:00', Decimal('127'), Decimal('159'), Decimal('145'), Decimal('176'), Decimal('137'), Decimal('103'), Decimal('282'))]